In [1]:
import pandas as pd
import numpy as np

# 1. Ordenar o DataFrame com base noutra lista

In [60]:
df = pd.DataFrame([["A", 1],
                   ["B", 2],
                   ["C", 3],
                   ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [61]:
sort_list = ["C", "A", "D", "B"]

In [62]:
## inicie o seu código abaixo
#new_df = ...
## termine aqui o seu código
s = pd.Series(range(len(sort_list)), index=sort_list)
new_df = df.sort_values("col_A", key = lambda x: x.map(s))
#new_df = df.set_index("col_A").loc[sort_list].reset_index()
#ou
#df["col1"] = pd.Categorical(df["col_A"], categories=sort_list, ordered=True)
#new_df = df.sort_values("col_A").reset_index(drop=True)

In [63]:
new_df

  col_A  col_B
2     C      3
0     A      1
3     D      4
1     B      2

# 2. Inserir uma coluna numa posição específica num DataFrame

In [64]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [65]:
new_column = ["P", "Q", "R", "S"]

insert_position = 1 ## entre col_A e col_B

In [66]:
## inicie o seu código abaixo
#new_df = ...
## termine aqui o seu código
df.insert(insert_position, "col_C", new_column)
new_df = df

In [67]:
new_df

  col_A col_C  col_B
0     A     P      1
1     B     Q      2
2     C     R      3
3     D     S      4

# 3. Selecionar colunas com base no tipo de dados da coluna

In [68]:
df = pd.DataFrame([["A", 1, True], ["B", 2, False],
                   ["C", 3, False], ["D", 4, True]], 
                  columns=["col_A", "col_B", "col_C"])

df

  col_A  col_B  col_C
0     A      1   True
1     B      2  False
2     C      3  False
3     D      4   True

In [69]:
dt_type = "bool"

In [70]:
## inicie o seu código abaixo
new_df = df.select_dtypes(include=[dt_type])
## termine aqui o seu código

In [71]:
new_df

   col_C
0   True
1  False
2  False
3   True

# 4. Contar o número de células Non-NaN para cada coluna

In [72]:
df = pd.DataFrame([["A", np.nan], [np.nan, 2],
                   ["C", np.nan], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    NaN
1   NaN    2.0
2     C    NaN
3     D    4.0

In [73]:
## inicie o seu código abaixo
new_df = df.count()
## termine aqui o seu código

In [74]:
new_df

col_A    3
col_B    2
dtype: int64

# 5. Dividir o DataFrame em partes iguais

In [75]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [76]:
parts = 2

In [77]:
## inicie o seu código abaixo
new_df1, new_df2 = np.array_split(df, parts)
## termine aqui o seu código

d:\PastaUFCDs\UFCD1080803032025\Pandas - Ficha 1\venv\Lib\site-packages\numpy\_core\fromnumeric.py:57: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.
  return bound(*args, **kwds)

In [78]:
new_df1

  col_A  col_B
0     A      1
1     B      2

In [79]:
new_df2

  col_A  col_B
2     C      3
3     D      4

# 6. Inverter o DataFrame por linha ou coluna

In [80]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [81]:
## inicie o seu código abaixo
col_reverse = df.loc[:, ::-1]
## termine aqui o seu código

In [82]:
col_reverse

   col_B col_A
0      1     A
1      2     B
2      3     C
3      4     D

In [83]:
## inicie o seu código abaixo
row_reverse = df.iloc[::-1]
## termine aqui o seu código

In [84]:
row_reverse

  col_A  col_B
3     D      4
2     C      3
1     B      2
0     A      1

# 7. Reorganizar as colunas de um DataFrame

In [85]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [86]:
## inicie o seu código abaixo
new_df = df[["col_B", "col_A"]]
## termine aqui o seu código

In [87]:
new_df

   col_B col_A
0      1     A
1      2     B
2      3     C
3      4     D

# 8. Obter linhas alternativas de um DataFrame

In [88]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [89]:
## inicie o seu código abaixo
new_df = df.iloc[::2]
## termine aqui o seu código

In [90]:
new_df

  col_A  col_B
0     A      1
2     C      3

# 9. Inserir uma linha numa posição arbitrária

In [91]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [92]:
insert_pos = 1
insert_row = ["P", 5]

In [93]:
## inicie o seu código abaixo
new_row = pd.DataFrame([insert_row], columns=["col_A", "col_B"])
new_df = pd.concat([df.iloc[:insert_pos], new_row, df.iloc[insert_pos:]]).reset_index(drop=True)
## termine aqui o seu código

In [94]:
new_df

  col_A  col_B
0     A      1
1     P      5
2     B      2
3     C      3
4     D      4

# 10. Aplicar uma função a todas as células do DataFrame

In [95]:
df = pd.DataFrame([[1, 5], [2, 6],
                   [3, 7], [4, 8]], 
                  columns=["col_A", "col_B"])

df

   col_A  col_B
0      1      5
1      2      6
2      3      7
3      4      8

In [96]:
def func(num):
    return num + 1

In [97]:
## inicie o seu código abaixo
new_df = df.applymap(func)
## termine aqui o seu código

C:\Users\Pedro\AppData\Local\Temp\ipykernel_9012\1641867100.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  new_df = df.applymap(func)

In [98]:
new_df

   col_A  col_B
0      2      6
1      3      7
2      4      8
3      5      9